export const routerMeta = {
    "specName": "ocr-api::2021-07-07",
    "modName": "",
    "spec": {
        "deprecated": false,
        "description": "#### 本接口适用场景\n* 阿里云通用手写体识别，是阿里云官方自研OCR文字识别产品，适用于获取手写体书面形式的文字场景，适用于各类手写笔记、板书等。\n* 阿里云OCR产品基于阿里巴巴达摩院强大的AI技术及海量数据，历经多年沉淀打磨，具有服务稳定、操作简易、实时性高、能力全面等几大优势。\n* 本接口图片示例\n<p style=\"text-align:center\"><img src=\"https://img.alicdn.com/tfs/TB1xvaLcggP7K4jSZFqXXamhVXa-1600-920.jpg\" width=\"70%\"></p>\n\n#### 本接口核心能力\n  \n|分类 |概述|\n|---|---------|\n|多文字形式|支持中文手写体、英文手写体、数字手写体。|\n|图像增强|默认支持图像增强，包括图像自动旋转、畸变自动矫正、模糊图片自动增强等能力。|\n|多类型覆盖|支持模糊、光照不均、透视畸变、任意背景等低质量图像识别。|\n|高精度识别|总体识别准确率可达98%。|\n\n#### 如何使用本接口\n\n|步骤|概述|\n|--|---|\n|1|开通 [通用文字识别](https://common-buy.aliyun.com?commodityCode=ocr_general_public_cn) 服务。开通服务前后，您可以通过[体验馆](https://duguang.aliyun.com/experience?type=universal&subtype=shouxie#intro)免费体验本功能识别效果。|\n|2|购买[通用手写体识别资源包](https://common-buy.aliyun.com/?commodityCode=ocr_general_dp_cn&request=%7B%22ord_time%22:%221:Year%22,%22order_num%22:1,%22pack%22:%22ocr_general_dp_cn_20211103172431_0249%22,%22flowout_spec%22:%22500%22%7D)。本API会赠送免费额度，可使用免费额度测试。|\n|3|可以参照[调试页面](https://next.api.aliyun.com/api/ocr-api/2021-07-07/RecognizeHandwriting?sdkStyle=dara)提供的代码示例完成API接入开发。接入完成后，调用API获取识别结果。如果使用子账号调用接口，需要阿里云账号（主账号）对RAM账号进行授权。创建RAM用户的具体操作，请参考：[创建RAM用户。](https://help.aliyun.com/document_detail/93720.html)文字识别服务提供一种系统授权策略，即**AliyunOCRFullAccess**。具体授权操作，请参见[在用户页面为RAM用户授权。](https://help.aliyun.com/document_detail/116146.html)|\n\n#### 重要提示\n|类型|概述|\n|----|-------------------|\n|图片格式|<ul> <li>本接口支持：PNG、JPG、JPEG、BMP、GIF、TIFF、WebP。暂不支持PDF格式。</li></ul>|\n|图片尺寸|<ul> <li> 图片长宽需要大于15像素，小于8192像素。</li> <li>长宽比需要小于50。</li> <li>如需达到较好识别效果，建议长宽均大于500px。</li> <li> 图片尺寸过小，会影响识别精度。图片内单字大小在10-50px内时，识别效果较好。 </li> </ul>|\n|图片大小|<ul> <li> 图片二进制文件不能超过10MB。</li> <li> 图片过大会影响接口响应速度，建议使用小于1.5M图片进行识别，且通过传图片URL的方式调用接口。</li> </ul>|\n|其他提示|<ul> <li>接口响应速度和图片中的文字数量有关，如果图片中文字数量越多，接口响应可能越慢。</li> <li> 接口会自动处理反光、扭曲等干扰信息，但会影响精度。请尽量选择清晰度高、无反光、无扭曲的图片。 </li> </ul>|\n|相关能力|<ul> <li> [云市场手写体识别。](https://market.aliyun.com/products/57124001/cmapi00040832.html?#sku=yuncode3483200001) </li> </ul>|",
        "ext": {
            "methods": [
                "get",
                "post"
            ],
            "operationType": "read",
            "responseDemo": "[{\"type\":\"json\",\"example\":\"{\\n  \\\"RequestId\\\": \\\"43A29C77-405E-4CC0-BC55-EE694AD00655\\\",\\n  \\\"Data\\\": \\\"{\\\\\\\"content\\\\\\\":\\\\\\\"炼句 提问方式 1.请赏析诗歌某一联(句) 2.赏析某一联(句)的妙处 3.请赏析诗歌某、角度抒胸意、借景抒情、托物\\\\\\\",\\\\\\\"height\\\\\\\":1277,\\\\\\\"orgHeight\\\\\\\":1277,\\\\\\\"orgWidth\\\\\\\":1080,\\\\\\\"prism_version\\\\\\\":\\\\\\\"1.0.9\\\\\\\",\\\\\\\"prism_wnum\\\\\\\":26,\\\\\\\"prism_wordsInfo\\\\\\\":[{\\\\\\\"angle\\\\\\\":-87,\\\\\\\"direction\\\\\\\":0,\\\\\\\"height\\\\\\\":83,\\\\\\\"pos\\\\\\\":[{\\\\\\\"x\\\\\\\":177,\\\\\\\"y\\\\\\\":56},{\\\\\\\"x\\\\\\\":260,\\\\\\\"y\\\\\\\":60},{\\\\\\\"x\\\\\\\":259,\\\\\\\"y\\\\\\\":88},{\\\\\\\"x\\\\\\\":176,\\\\\\\"y\\\\\\\":84}],\\\\\\\"prob\\\\\\\":96,\\\\\\\"width\\\\\\\":28,\\\\\\\"word\\\\\\\":\\\\\\\"炼句\\\\\\\",\\\\\\\"x\\\\\\\":203,\\\\\\\"y\\\\\\\":30}],\\\\\\\"width\\\\\\\":1080}\\\",\\n  \\\"Code\\\": \\\"200\\\",\\n  \\\"Message\\\": \\\"message\\\"\\n}\",\"errorExample\":\"\"},{\"type\":\"xml\",\"example\":\"<RecognizeHandwritingResponse>\\n    <RequestId>4AA3FA7B-CB2D-4314-B812-A598B540BADA</RequestId>\\n    <Data>{\\\"content\\\":\\\"炼句 提问方式 1.请赏析诗歌某一联(句) 2.赏析某一联(句)的妙处 3.请赏析诗歌某一联1句)的表达效果 常规答题思路 1.手法: 1写景的句子侧重于写景手法(感官、角度.动静、虚实、典型画面、寓情于景等) ②写人的句子侧重于写人手法(动作、心理、肖像、细节等) ③抒情的句子侧重于抒情方式(直抒胸意、借景抒情、托物言志、用典抒情、 借古讽今等) 2.内容:写出…内容,描绘…的情景(画面),体现.特点 3.情感:表达了……的情感心理),或者渲染了…..的意境氛围 4.结构: 照应1与标题或者前后某内容照应),铺垫(为下文作了铺垫) 说明 1.所考的是诗歌的第一句,有时要考虑:点明时令,总领全诗,奠定情感基调 所考的是诗歌的最后一句,有时要考虑:言有尽而意无穷,给读者留下 想象空间。 2.如果该句没有什么突出手法,那么我们的精力应该花在内容、情感结构上 题型迁移 二 提问方式:某句诗有什么作用 作用题的答题模式约等于“炼句题” 说明:“炼句“与某句诗作用”的区别 “炼句”侧重于本句的手法,而“某句诗作用“则是侧重于结构与内容。 \\\",\\\"height\\\":1277,\\\"orgHeight\\\":1277,\\\"orgWidth\\\":1080,\\\"prism_version\\\":\\\"1.0.9\\\",\\\"prism_wnum\\\":26,\\\"prism_wordsInfo\\\":[{\\\"angle\\\":-87,\\\"direction\\\":0,\\\"height\\\":83,\\\"pos\\\":[{\\\"x\\\":177,\\\"y\\\":56},{\\\"x\\\":260,\\\"y\\\":60},{\\\"x\\\":259,\\\"y\\\":88},{\\\"x\\\":176,\\\"y\\\":84}],\\\"prob\\\":96,\\\"width\\\":28,\\\"word\\\":\\\"炼句\\\",\\\"x\\\":203,\\\"y\\\":30},{\\\"angle\\\":-87,\\\"direction\\\":0,\\\"height\\\":115,\\\"pos\\\":[{\\\"x\\\":172,\\\"y\\\":114},{\\\"x\\\":287,\\\"y\\\":120},{\\\"x\\\":286,\\\"y\\\":146},{\\\"x\\\":171,\\\"y\\\":141}],\\\"prob\\\":98,\\\"width\\\":27,\\\"word\\\":\\\"提问方式\\\",\\\"x\\\":215,\\\"y\\\":71},{\\\"angle\\\":-89,\\\"direction\\\":0,\\\"height\\\":280,\\\"pos\\\":[{\\\"x\\\":287,\\\"y\\\":119},{\\\"x\\\":567,\\\"y\\\":119},{\\\"x\\\":567,\\\"y\\\":146},{\\\"x\\\":287,\\\"y\\\":146}],\\\"prob\\\":97,\\\"width\\\":26,\\\"word\\\":\\\"1.请赏析诗歌某一联(句)\\\",\\\"x\\\":414,\\\"y\\\":-8},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":27,\\\"pos\\\":[{\\\"x\\\":286,\\\"y\\\":167},{\\\"x\\\":576,\\\"y\\\":164},{\\\"x\\\":576,\\\"y\\\":192},{\\\"x\\\":286,\\\"y\\\":194}],\\\"prob\\\":98,\\\"width\\\":289,\\\"word\\\":\\\"2.赏析某一联(句)的妙处\\\",\\\"x\\\":286,\\\"y\\\":165},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":30,\\\"pos\\\":[{\\\"x\\\":285,\\\"y\\\":213},{\\\"x\\\":667,\\\"y\\\":207},{\\\"x\\\":667,\\\"y\\\":236},{\\\"x\\\":285,\\\"y\\\":242}],\\\"prob\\\":96,\\\"width\\\":382,\\\"word\\\":\\\"3.请赏析诗歌某一联1句)的表达效果\\\",\\\"x\\\":285,\\\"y\\\":209},{\\\"angle\\\":-90,\\\"direction\\\":0,\\\"height\\\":156,\\\"pos\\\":[{\\\"x\\\":165,\\\"y\\\":284},{\\\"x\\\":321,\\\"y\\\":284},{\\\"x\\\":321,\\\"y\\\":310},{\\\"x\\\":165,\\\"y\\\":310}],\\\"prob\\\":98,\\\"width\\\":26,\\\"word\\\":\\\"常规答题思路\\\",\\\"x\\\":231,\\\"y\\\":219},{\\\"angle\\\":-2,\\\"direction\\\":0,\\\"height\\\":26,\\\"pos\\\":[{\\\"x\\\":357,\\\"y\\\":288},{\\\"x\\\":441,\\\"y\\\":286},{\\\"x\\\":442,\\\"y\\\":312},{\\\"x\\\":358,\\\"y\\\":314}],\\\"prob\\\":97,\\\"width\\\":84,\\\"word\\\":\\\"1.手法：\\\",\\\"x\\\":357,\\\"y\\\":287},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":32,\\\"pos\\\":[{\\\"x\\\":163,\\\"y\\\":332},{\\\"x\\\":958,\\\"y\\\":319},{\\\"x\\\":959,\\\"y\\\":351},{\\\"x\\\":163,\\\"y\\\":364}],\\\"prob\\\":91,\\\"width\\\":796,\\\"word\\\":\\\"1写景的句子侧重于写景手法(感官、角度.动静、虚实、典型画面、寓情于景等)\\\",\\\"x\\\":163,\\\"y\\\":324},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":30,\\\"pos\\\":[{\\\"x\\\":161,\\\"y\\\":380},{\\\"x\\\":768,\\\"y\\\":374},{\\\"x\\\":768,\\\"y\\\":404},{\\\"x\\\":162,\\\"y\\\":410}],\\\"prob\\\":96,\\\"width\\\":607,\\\"word\\\":\\\"②写人的句子侧重于写人手法(动作、心理、肖像、细节等)\\\",\\\"x\\\":161,\\\"y\\\":376},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":30,\\\"pos\\\":[{\\\"x\\\":159,\\\"y\\\":430},{\\\"x\\\":951,\\\"y\\\":417},{\\\"x\\\":951,\\\"y\\\":448},{\\\"x\\\":159,\\\"y\\\":460}],\\\"prob\\\":91,\\\"width\\\":792,\\\"word\\\":\\\"③抒情的句子侧重于抒情方式(直抒胸意、借景抒情、托物言志、用典抒情、\\\",\\\"x\\\":159,\\\"y\\\":423},{\\\"angle\\\":-89,\\\"direction\\\":0,\\\"height\\\":141,\\\"pos\\\":[{\\\"x\\\":155,\\\"y\\\":477},{\\\"x\\\":297,\\\"y\\\":479},{\\\"x\\\":296,\\\"y\\\":507},{\\\"x\\\":155,\\\"y\\\":505}],\\\"prob\\\":96,\\\"width\\\":27,\\\"word\\\":\\\"借古讽今等)\\\",\\\"x\\\":212,\\\"y\\\":420},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":31,\\\"pos\\\":[{\\\"x\\\":154,\\\"y\\\":527},{\\\"x\\\":830,\\\"y\\\":522},{\\\"x\\\":830,\\\"y\\\":553},{\\\"x\\\":154,\\\"y\\\":559}],\\\"prob\\\":97,\\\"width\\\":677,\\\"word\\\":\\\"2.内容：写出…内容，描绘…的情景(画面)，体现.特点\\\",\\\"x\\\":154,\\\"y\\\":524},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":30,\\\"pos\\\":[{\\\"x\\\":150,\\\"y\\\":579},{\\\"x\\\":826,\\\"y\\\":571},{\\\"x\\\":827,\\\"y\\\":602},{\\\"x\\\":150,\\\"y\\\":610}],\\\"prob\\\":91,\\\"width\\\":677,\\\"word\\\":\\\"3.情感：表达了……的情感心理)，或者渲染了…..的意境氛围\\\",\\\"x\\\":150,\\\"y\\\":575},{\\\"angle\\\":-1,\\\"direction\\\":0,\\\"height\\\":28,\\\"pos\\\":[{\\\"x\\\":148,\\\"y\\\":635},{\\\"x\\\":262,\\\"y\\\":630},{\\\"x\\\":263,\\\"y\\\":658},{\\\"x\\\":149,\\\"y\\\":663}],\\\"prob\\\":97,\\\"width\\\":115,\\\"word\\\":\\\"4.结构：\\\",\\\"x\\\":148,\\\"y\\\":631},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":29,\\\"pos\\\":[{\\\"x\\\":273,\\\"y\\\":631},{\\\"x\\\":916,\\\"y\\\":621},{\\\"x\\\":917,\\\"y\\\":651},{\\\"x\\\":274,\\\"y\\\":661}],\\\"prob\\\":96,\\\"width\\\":643,\\\"word\\\":\\\"照应1与标题或者前后某内容照应)，铺垫(为下文作了铺垫)\\\",\\\"x\\\":273,\\\"y\\\":626},{\\\"angle\\\":-90,\\\"direction\\\":0,\\\"height\\\":60,\\\"pos\\\":[{\\\"x\\\":150,\\\"y\\\":712},{\\\"x\\\":210,\\\"y\\\":712},{\\\"x\\\":210,\\\"y\\\":738},{\\\"x\\\":150,\\\"y\\\":738}],\\\"prob\\\":99,\\\"width\\\":26,\\\"word\\\":\\\"说明\\\",\\\"x\\\":167,\\\"y\\\":694},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":31,\\\"pos\\\":[{\\\"x\\\":155,\\\"y\\\":764},{\\\"x\\\":988,\\\"y\\\":752},{\\\"x\\\":989,\\\"y\\\":783},{\\\"x\\\":155,\\\"y\\\":794}],\\\"prob\\\":95,\\\"width\\\":834,\\\"word\\\":\\\"1.所考的是诗歌的第一句，有时要考虑：点明时令，总领全诗，奠定情感基调\\\",\\\"x\\\":154,\\\"y\\\":757},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":31,\\\"pos\\\":[{\\\"x\\\":189,\\\"y\\\":815},{\\\"x\\\":954,\\\"y\\\":809},{\\\"x\\\":954,\\\"y\\\":840},{\\\"x\\\":189,\\\"y\\\":846}],\\\"prob\\\":98,\\\"width\\\":765,\\\"word\\\":\\\"所考的是诗歌的最后一句，有时要考虑：言有尽而意无穷，给读者留下\\\",\\\"x\\\":188,\\\"y\\\":811},{\\\"angle\\\":-89,\\\"direction\\\":0,\\\"height\\\":120,\\\"pos\\\":[{\\\"x\\\":147,\\\"y\\\":874},{\\\"x\\\":267,\\\"y\\\":874},{\\\"x\\\":267,\\\"y\\\":902},{\\\"x\\\":147,\\\"y\\\":902}],\\\"prob\\\":98,\\\"width\\\":28,\\\"word\\\":\\\"想象空间。\\\",\\\"x\\\":191,\\\"y\\\":827},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":32,\\\"pos\\\":[{\\\"x\\\":140,\\\"y\\\":957},{\\\"x\\\":1002,\\\"y\\\":950},{\\\"x\\\":1002,\\\"y\\\":983},{\\\"x\\\":140,\\\"y\\\":990}],\\\"prob\\\":96,\\\"width\\\":862,\\\"word\\\":\\\"2.如果该句没有什么突出手法，那么我们的精力应该花在内容、情感结构上\\\",\\\"x\\\":139,\\\"y\\\":953},{\\\"angle\\\":-89,\\\"direction\\\":0,\\\"height\\\":127,\\\"pos\\\":[{\\\"x\\\":133,\\\"y\\\":1043},{\\\"x\\\":260,\\\"y\\\":1045},{\\\"x\\\":260,\\\"y\\\":1076},{\\\"x\\\":133,\\\"y\\\":1074}],\\\"prob\\\":97,\\\"width\\\":31,\\\"word\\\":\\\"题型迁移\\\",\\\"x\\\":180,\\\"y\\\":995},{\\\"angle\\\":-90,\\\"direction\\\":0,\\\"height\\\":38,\\\"pos\\\":[{\\\"x\\\":5,\\\"y\\\":1109},{\\\"x\\\":44,\\\"y\\\":1109},{\\\"x\\\":44,\\\"y\\\":1150},{\\\"x\\\":5,\\\"y\\\":1150}],\\\"prob\\\":79,\\\"width\\\":40,\\\"word\\\":\\\"二\\\",\\\"x\\\":4,\\\"y\\\":1108},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":34,\\\"pos\\\":[{\\\"x\\\":130,\\\"y\\\":1103},{\\\"x\\\":468,\\\"y\\\":1098},{\\\"x\\\":469,\\\"y\\\":1131},{\\\"x\\\":130,\\\"y\\\":1136}],\\\"prob\\\":97,\\\"width\\\":339,\\\"word\\\":\\\"提问方式：某句诗有什么作用\\\",\\\"x\\\":129,\\\"y\\\":1099},{\\\"angle\\\":-89,\\\"direction\\\":0,\\\"height\\\":411,\\\"pos\\\":[{\\\"x\\\":495,\\\"y\\\":1099},{\\\"x\\\":905,\\\"y\\\":1101},{\\\"x\\\":905,\\\"y\\\":1132},{\\\"x\\\":494,\\\"y\\\":1130}],\\\"prob\\\":97,\\\"width\\\":30,\\\"word\\\":\\\"作用题的答题模式约等于“炼句题”\\\",\\\"x\\\":684,\\\"y\\\":910},{\\\"angle\\\":-1,\\\"direction\\\":0,\\\"height\\\":33,\\\"pos\\\":[{\\\"x\\\":125,\\\"y\\\":1168},{\\\"x\\\":552,\\\"y\\\":1159},{\\\"x\\\":553,\\\"y\\\":1191},{\\\"x\\\":126,\\\"y\\\":1201}],\\\"prob\\\":98,\\\"width\\\":427,\\\"word\\\":\\\"说明：“炼句“与某句诗作用”的区别\\\",\\\"x\\\":124,\\\"y\\\":1163},{\\\"angle\\\":0,\\\"direction\\\":0,\\\"height\\\":33,\\\"pos\\\":[{\\\"x\\\":131,\\\"y\\\":1226},{\\\"x\\\":897,\\\"y\\\":1221},{\\\"x\\\":898,\\\"y\\\":1255},{\\\"x\\\":132,\\\"y\\\":1260}],\\\"prob\\\":95,\\\"width\\\":766,\\\"word\\\":\\\"“炼句”侧重于本句的手法，而“某句诗作用“则是侧重于结构与内容。\\\",\\\"x\\\":130,\\\"y\\\":1224}],\\\"width\\\":1080}</Data>\\n</RecognizeHandwritingResponse>\",\"errorExample\":\"\"}]",
            "responseParamsDescription": "#### 返回参数说明\n<br/>\n\n|字段|类型|说明|\n|-----|---|--|\n|angle|int|图片的角度（当NeedRotate=true时，返回此字段）。0表示正向，90表示图片朝右，180朝下，270朝左。|\n|content|string|识别出图片的文字块汇总。|\n|prism_wordsInfo|list|文字块信息。|\n|prism_tablesInfo|list|表格信息（当OutputTable=true时，返回此字段）。|\n|prism_wnum|int|识别的文字块的数量，prism_wordsInfo数组的大小。|\n|height|int|算法矫正图片后的高度。|\n|width|int|算法矫正图片后的宽度。|\n|orgHeight|int|原图的高度。|\n|orgWidth|int|原图的宽度。|\n\n#### 文字块信息（prism_wordsInfo字段。）\n|字段|类型|说明|\n|-----|---|--|\n|angle|int|文字块的角度。|\n|height|int|算法矫正图片后的高度。|\n|width|int|算法矫正图片后的宽度。|\n|pos|list|文字块的外矩形四个点的坐标按顺时针排列（左上、右上、右下、左下）。当NeedRotate=true时，如果最外层的angle不为0，需要按照angle矫正图片后，坐标才准确。|\n|word|string|文字块的文字内容。|\n|tableId|int|表格的id（当OutputTable=true时，返回此字段）。|\n|tableCellId|int|表格中单元格的id（当OutputTable=true时，返回此字段）。|\n|charInfo|list|单字信息。|\n\n#### 单字信息（charInfo字段。当OutputCharInfo=true时，返回此字段。）\n|字段|类型|说明|\n|-----|---|--|\n|word|string|单字文字。|\n|prob|int|置信度。|\n|x|int|单字左上角横坐标。|\n|y|int|单字左上角纵坐标。|\n|w|int|单字宽度。|\n|h|int|单字高度。|\n\n#### 表格信息（prism_tablesInfo字段。当OutputTable=true时，返回此字段。）\n|字段|类型|说明|\n|-----|---|--|\n|tableId|int|表格id，和prism_wordsInfo信息中的tableId对应。|\n|xCellSize|int|表格中横坐标单元格的数量。|\n|yCellSize|int|表格中纵坐标单元格的数量。|\n|cellInfos|list|单元格信息。|\n\n#### 单元格信息（cellInfos字段。）\n|字段|类型|说明|\n|-----|---|--|\n|tableCellId|int|表格中单元格id，和prism_wordsInfo信息中的tableCellId对应。|\n|word|string|单元格中的文字。|\n|xsc|int|xStartCell缩写，表示横轴方向该单元格起始在第几个单元格，第一个单元格值为0。|\n|xec|int|xEndCell缩写，表示横轴方向该单元格结束在第几个单元格，第一个单元格值为0，如果xsc和xec都为0说明该文字在横轴方向占据了一个单元格并且在第一个单元格内。|\n|ysc|int|yStartCell缩写，表示纵轴方向该单元格起始在第几个单元格，第一个单元格值为0。|\n|yec|int|yEndCell缩写，表示纵轴方向该单元格结束在第几个单元格，第一个单元格值为0。|\n|pos|list|单元格位置，按照单元格四个角的坐标顺时针排列，分别为左上XY坐标、右上XY坐标、右下XY坐标、左下XY坐标。|",
            "schemes": [
                "http",
                "https"
            ],
            "security": [
                {
                    "AK": []
                }
            ],
            "summary": "通用手写体识别。",
            "title": "通用手写体识别"
        },
        "externalDocs": {
            "description": "去调试",
            "url": "https://api.aliyun.com/api/ocr-api/2021-07-07/RecognizeHandwriting"
        },
        "method": "get",
        "name": "RecognizeHandwriting",
        "parameters": [
            {
                "in": "query",
                "name": "Url",
                "required": false,
                "schema": {
                    "description": "* 本字段和body字段二选一，不可同时透传或同时为空。\n* 图片链接（长度不超2048，不支持base64）。",
                    "example": "https://img.alicdn.com/tfs/TB1Wo7eXAvoK1RjSZFDXXXY3pXa-2512-3509.jpg",
                    "required": false,
                    "title": "图片链接（长度不超 2048，不支持 base64）",
                    "type": "string"
                }
            },
            {
                "in": "body",
                "name": "body",
                "required": false,
                "schema": {
                    "description": "* 本字段和URL字段二选一，不可同时透传或同时为空。\n* 图片二进制文件，最大10MB。\n* 使用HTTP方式调用，把图片二进制文件放到HTTP body中上传即可。\n* 使用SDK的方式调用，把图片放到SDK的body中即可。",
                    "example": "图片二进制文件",
                    "format": "binary",
                    "required": false,
                    "title": "图片二进制字节流，最大10MB",
                    "type": "string"
                }
            },
            {
                "in": "query",
                "name": "OutputCharInfo",
                "required": false,
                "schema": {
                    "description": "* 是否输出单字识别结果，默认不需要。\n* true：需要；false：不需要。",
                    "example": "false",
                    "required": false,
                    "title": "是否输出单字识别结果",
                    "type": "boolean"
                }
            },
            {
                "in": "query",
                "name": "NeedRotate",
                "required": false,
                "schema": {
                    "description": "* 是否需要自动旋转功能，默认不需要。\n* true：需要；false：不需要。",
                    "example": "false",
                    "required": false,
                    "title": "是否需要自动旋转功能(结构化检测、混贴场景、教育相关场景会自动做旋转，无需设置)，返回角度信息",
                    "type": "boolean"
                }
            },
            {
                "in": "query",
                "name": "OutputTable",
                "required": false,
                "schema": {
                    "description": "* 是否输出表格识别结果，包含单元格信息，默认不需要。\n* true：需要；false：不需要。",
                    "example": "false",
                    "required": false,
                    "title": "是否输出表格识别结果，包含单元格信息",
                    "type": "boolean"
                }
            },
            {
                "in": "query",
                "name": "NeedSortPage",
                "required": false,
                "schema": {
                    "description": "* 是否按顺序输出文字块，默认为false。\n* false表示从左往右，从上到下的顺序；true表示从上到下，从左往右的顺序。",
                    "example": "false",
                    "required": false,
                    "title": "是否按顺序输出文字块。false表示从左往右，从上到下的顺序；true表示从上到下，从左往右的顺序",
                    "type": "boolean"
                }
            }
        ],
        "responses": {
            "200": {
                "schema": {
                    "description": "Schema of Response",
                    "properties": {
                        "Code": {
                            "description": "状态码",
                            "example": "200",
                            "type": "string"
                        },
                        "Data": {
                            "description": "返回数据",
                            "example": "{\"content\":\"炼句 提问方式 1.请赏析诗歌某一联(句) 2.赏析某一联(句)的妙处 3.请赏析诗歌某、角度抒胸意、借景抒情、托物\",\"height\":1277,\"orgHeight\":1277,\"orgWidth\":1080,\"prism_version\":\"1.0.9\",\"prism_wnum\":26,\"prism_wordsInfo\":[{\"angle\":-87,\"direction\":0,\"height\":83,\"pos\":[{\"x\":177,\"y\":56},{\"x\":260,\"y\":60},{\"x\":259,\"y\":88},{\"x\":176,\"y\":84}],\"prob\":96,\"width\":28,\"word\":\"炼句\",\"x\":203,\"y\":30}],\"width\":1080}",
                            "type": "string"
                        },
                        "Message": {
                            "description": "详细信息 ",
                            "example": "message",
                            "type": "string"
                        },
                        "RequestId": {
                            "description": "请求唯一 ID",
                            "example": "43A29C77-405E-4CC0-BC55-EE694AD00655",
                            "type": "string"
                        }
                    },
                    "title": "Schema of Response",
                    "type": "object"
                }
            }
        },
        "summary": "通用手写体识别。",
        "title": "通用手写体识别"
    },
    "name": "RecognizeHandwriting",
    "pageType": "document",
    "schemaType": "api"
}